MortgagesDataLayer/src/main/resources/SoapRequests/getAllMortgagesByOfferDate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mor="http://www.barclays.org/mortgage/">
   <soapenv:Header/>
   <soapenv:Body>
      <mor:getMortgagesRequest>
         <orderBy>offerDate</orderBy>
      </mor:getMortgagesRequest>
   </soapenv:Body>
</soapenv:Envelope>