MortgagesDataLayer/src/main/resources/SoapRequests/getMaxVersionNumber.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mor="http://www.barclays.org/mortgage/">
   <soapenv:Header/>
   <soapenv:Body>
      <mor:getMaxVersionByMortgageIDRequest>
         <mortgageIDReq>M3</mortgageIDReq>
      </mor:getMaxVersionByMortgageIDRequest>
   </soapenv:Body>
</soapenv:Envelope>